{
  "app_name": "Blood Donation",
  "nav": {
    "home": "Home",
    "about": "About",
    "instructions": "Instructions",
    "process": "Process",
    "search": "Search",
    "donate": "Donate"
  },
  "ready_donate": {
    "header": "Ready to Donate?",
    "text": "It does not make much time and every donation has the power to save up to three lives",
    "button": "Donate"
  },
  "table": {
    "name": "Donor Name",
    "bloodType": "Blood Type",
    "city": "City",
    "phone": "Phone Number",
    "email": "Email Address"
  },
  "Process": {
    "titlePrograph": "Follow our tips to make your blood donation experience pleasant, safe and straightforward.",
    "titleInstructionCard": "instruction for your donation",
    "descTitleprog": "ensure the safety of both patients and donors, these are some of the requirements donors must meet to be eligible to donate blood It's important you review this information before donation.",
    "age": "Age",
    "descAge": "Must be at least 16 years old (16- and 17-year-olds must bring a signed permission form from a parent or guardian, if required by state or school).",
    "weight": "weight",
    "weightdesc": "Weighs at least 110 pounds. Certain height/weight criteria may apply for donors 22 years old or younger.",
    "generalhealth": "General health",
    "general_health_desc": "Consult your doctor before donating blood if there are any health issues or concerns. It is always good to have healthy diet weeks before the donation",
    "eat": "Eat",
    "eat_desc": "For your safety and to ensure a positive donation experience, make sure you eat within two hours ahead of your donation.",
    "drink": "Drink",
    "drinkdesc": "Drink plenty of water that day and drink an extra four (8 oz.) glasses of liquids and avoid alcohol over the next 24 hours.",
    "wait": "wait",
    "waitdesc": "You must wait eight weeks between whole blood donations. ",
    "title_blood_donation": "The Blood Donation Process    ",
    "secondtitle_blood_donation": " (What to Expect at Your Donation)",
    "blood_donation_desc": "The blood donation process from the time you arrive until the time you leave takes about an hour. The donation itself is only about 8-10 minutes on average "
  },
  "HomePage": {
    "donate": "Donate",
    "HeroTitle1": "Save Another Life ",
    "HeroTitle2": "By donating your blood",
    "DonateOverviewTitle": "Donate Blood Overview",
    "DonateOverviewDecs": "What do we all have in common that instantly connects us and gives us the power to do more? It’s the blood pulsing within each of us. Donating blood is one of the easiest ways to give back to your community. If you’ve never donated blood before, we encourage you to try. Blood helps trauma and burn patients, premature infants, heart surgery patients, organ transplant recipients and those fighting cancer, among others. In emergencies, it’s the blood already on hospital shelves that saves lives.",
    "DonateProcessTitle": "Donation Process",
    "DonateProcessDecs": " It takes about an hour from the time you arrive to the time you leave to complete a whole blood donation. The actual donation time is only about 10 minutes.for more info about the donation process",
    "CommonConcernTitle": "Common Concerns",
    "CommonConcernDecs": "Many people are reluctant to make their first blood donation, but once they do, they find the donation process to be easy and gratifying.",
    "CardOneTitle": "I Don't Like Needles",
    "CardOneDecs": "fear of needles certainly prevents some people from donating blood. But it is worth to spend a few minutes facing your fears to save someone’s live.",
    "CardTwoTitle": "Is it Safe to Donate?",
    "CardTwoDecs": "You’ll even be given a mini-physical at your appointment, to ensure you are healthy enough to donate that day. We’ll check your temperature, blood pressure.",
    "CardThreeTitle": "I'm Afraid I'll Faint",
    "CardThreeDecs": "If you do feel faint or fatigued,simply lie down until you feel better. think that you have about 10 pints of blood in your body. Roughly 1 pint is given.",
    "Partners": "Our Trusted Partner",
    "PartnerOne": "Al-Thawra Hosital",
    "PartnerTwo": "Al-Gomhori Hospital",
    "PartnerThree": "Blood Bank"
  },
  "dontDonate": {
    "header": "We are sorry but you are unable to donate.",
    "firstParagraph": "We really appreciate your support but unfortunately you will not be able to donate.",
    "secondParagraph": " We realise this can be disappointing but we thank you for coming forward today.",
    "thirdParagraph": " Ask your friends and family to join the blood donor community"
  },
  "donate_first_page": {
    "title": "Register your interest in becoming a blood donor.",
    "paragrph": "Thank you for your interest in saving lives and donating blood. You will be joining a community of blood donors who are called upon when needed by the NHS. We need 5,000 blood donations every day.",
    "subHeader1": "A few questions before we get started",
    "subHeader2": "All fields marked with * are required",
    "subparagrph": "A few quick questions up front to find out if you can donate blood or not. If you can't donate, don't worry you can help the NHS in other ways.",
    "birth_text": "1 . Date of birth*",
    "radio_text1": "2 . Do you weigh more than 50kg (7 stone 12lbs)?*",
    "radio_text2": "3 . Have you ever had a cancer other than basal cell carcinoma or cervical carcinoma insitu (CIN)?*",
    "radio_option_yes": "Yes",
    "radio_option_no": "No",
    "button": "Next",
    "step": "STEP",
    "dateError": "Insert a valid date",
    "wightError": "please answer this question",
    "sickError": "please answer this question"
  },
  "donate_second_page": {
    "great": "Great!",
    "title": "It looks like you can join the community to donate.",
    "paragrph": "Being one of those who can donate blood it means that you are going to help those who need blood as a result of sickness or accidents",
    "subHeader1": "Finding out more about you",
    "subHeader2": "All fields marked with * are required",
    "subparagrph": "Knowing more about you is really important and helps us to prioritise when we might ask you to donate. We only collect the right amount and types of blood to meet hospital demand as we don’t want to waste your donation if it’s not needed right now.",
    "male_text": "1. Gender",
    "blood_type_text": "2. Please select blood type (if known)?*",
    "city": "3. Please select your city ?*",
    "option_male": "Male",
    "option_female": "Female",
    "button_next": "Next",
    "button_previous": "Previous",
    "errorCity": "Choose your the city",
    "errorBlood": "Choose your blood type"
  },
  "donate_third_page": {
    "title": "We needs people like you.",
    "paragrph": "Male donors are particularly needed because they can donate more frequently and have higher iron levels.",
    "subHeader1": "Personal Information",
    "subparagrph": "We just need a little more information about you, to help us finish this stage and contact you about the next steps.",
    "name": "Name*",
    "phone": "Phone",
    "email": "Email",
    "name_placeholder": "Enter your name",
    "phone_placeholder": "Enter your phone",
    "email_placeholder": "Enter your email",
    "agree": "I have read and accept the terms and conditions of ",
    "terms": " the Blood Donor  Service",
    "button_next": "Register",
    "button_previous": "Previous",
    "errorName": "Enter your name please",
    "errorPhone": "Enter your phone number",
    "errorEmail": "Enter a valid email"
  },
  "donate_fourth_page": {
    "title": "You have been added to the donation list",
    "paragrph": "We would like to thank you for your supporting and becoming part of the blood donation . "
  },
  "cities": [
    "Abyan",
    "Aden",
    "Al Mahrah",
    "Hadramaut",
    "Lahij",
    "Shabwah",
    "Dhale",
    "Amran",
    "Al Bayda",
    "Al Hudaydah",
    "Al Jawf",
    "Al Mahwit",
    "Dhamar",
    "Hajjah",
    "Ibb",
    "Ma'rib",
    "Raymah",
    "Saada",
    "Sana'a",
    "Taiz",
    "Socotra"
  ],
  "Terms": {
    "TermsAndServices": "Terms and Services",
    "TermsText": " By visiting this website and accessing the information, resources, services, products and tools we provide, you understand and agree to accept and comply with the following terms and conditions ",
    "TermsOfUse": "Terms of use:",
    "firstTerm": "People  must understand that the information provided by them is available to a person seeking for a particular blood group.",
    "secondTerm": "We do not sell contact details of potential donors to any third party or use it in anyfor commercial gains.",
    "thirdTerm": "We does not arrange for blood. We only provide relevant information about potential donors to those in need of blood.",
    "forthTerm": "We do not guarantee that a potential donor will agree to donate blood whenever called upon to do so.",
    "fifthTerm": "We does not claim that potential donors are free from any disease, ailment, or bodily conditions preventing them from donating blood .",
    "sixthTerm": "We urge you not to registrations if you do not seriously wish to donate blood. It is a matter of life and death for those in need of blood.",
    "seventhTerm": "We reserves right to inactivate member at any given time in case found wrong information given or misuse of service .",
    "Services": " The Services:",
    "firstService": "Find out where you can donate.",
    "secondService": "Check your eligibility to donate.",
    "thirdService": "register for blood donation .",
    "forthService": "find potential donors.",
    "fifthService": "have answers to some of your concerns."
  },
  "bloodTypes": ["O-", "O+", " B-", "B+", " A-", "A+", "AB-", "AB+"],
  "search_page": {
    "herotext": "Please select a blood type and city name in order to get Donnors",
    "bloodtype": "Select blood type",
    "city": "Select city",
    "searchbutton": "Search",
    "tableHeader": "Availabe Donors",
    "tableText": "These  are sensitive information of volunteer people welling to help and save others life. Please keep in mind that these information should not be be used negatively."
  },
  "footer": {
    "text": "Solving the problem of blood emergencies by connecting blood donors directly with people in blood need."
  }
}
